yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/ethernet/src/rtl87x2g/rtl_ethernet_cpu_reg.h
#ifndef RTL_ETHERNET_CPU_REG_H
#define RTL_ETHERNET_CPU_REG_H

#include "utils/rtl_utils.h"

#ifdef  __cplusplus
extern "C" {
#endif /* __cplusplus */

/* ================================================================================ */
/* ================            ETH CPU Registers                  ================ */
/* ================================================================================ */
/**
  * @brief ETH_CPU
  */
/* 0x00
    31:0    R/W    txfdp1                      32'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t txfdp1: 32;
    } b;
} ETH_TXFDP1_TypeDef;

/* 0x04
    11:0    R      txcdo1                      12'h0
    15:12   R      reserved15_12               4'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        __I uint16_t txcdo1: 12;
        __I uint16_t reserved_0: 4;
    } b;
} ETH_TXCDO1_TypeDef;

/* 0x10
    31:0    R/W    txfdp2                      32'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t txfdp2: 32;
    } b;
} ETH_TXFDP2_TypeDef;

/* 0x14
    11:0    R      txcdo2                      12'h0
    15:12   R      reserved15_12               4'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        __I uint16_t txcdo2: 12;
        __I uint16_t reserved_0: 4;
    } b;
} ETH_TXCDO2_TypeDef;

/* 0x20
    31:0    R/W    txfdp3                      32'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t txfdp3: 32;
    } b;
} ETH_TXFDP3_TypeDef;

/* 0x24
    11:0    R      txcdo3                      12'h0
    15:12   R      reserved15_12               4'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        __I uint16_t txcdo3: 12;
        __I uint16_t reserved_0: 4;
    } b;
} ETH_TXCDO3_TypeDef;

/* 0x30
    31:0    R/W    txfdp4                      32'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t txfdp4: 32;
    } b;
} ETH_TXFDP4_TypeDef;

/* 0x34
    11:0    R      txcdo4                      12'h0
    15:12   R      reserved15_12               4'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        __I uint16_t txcdo4: 12;
        __I uint16_t reserved_0: 4;
    } b;
} ETH_TXCDO4_TypeDef;

/* 0x40
    31:0    R/W    txfdp5                      32'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t txfdp5: 32;
    } b;
} ETH_TXFDP5_TypeDef;

/* 0x44
    11:0    R      txcdo5                      12'h0
    15:12   R      reserved15_12               4'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        __I uint16_t txcdo5: 12;
        __I uint16_t reserved_0: 4;
    } b;
} ETH_TXCDO5_TypeDef;

/* 0x70
    2:0     R/W    ext1_pri0_route             3'h0
    3       R/W    reserved3                   1'h0
    6:4     R/W    ext1_pri1_route             3'h0
    7       R/W    reserved7                   1'h0
    10:8    R/W    ext1_pri2_route             3'h0
    11      R/W    reserved11                  1'h0
    14:12   R/W    ext1_pri3_route             3'h0
    15      R/W    reserved15                  1'h0
    18:16   R/W    ext1_pri4_route             3'h0
    19      R/W    reserved19                  1'h0
    22:20   R/W    ext1_pri5_route             3'h0
    23      R/W    reserved25                  1'h0
    26:24   R/W    ext1_pri6_route             3'h0
    27      R/W    reserved27                  1'h0
    30:28   R/W    ext1_pri7_route             3'h0
    31      R/W    reserved31                  1'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t ext1_pri0_route: 3;
        __IO uint32_t reserved_7: 1;
        __IO uint32_t ext1_pri1_route: 3;
        __IO uint32_t reserved_6: 1;
        __IO uint32_t ext1_pri2_route: 3;
        __IO uint32_t reserved_5: 1;
        __IO uint32_t ext1_pri3_route: 3;
        __IO uint32_t reserved_4: 1;
        __IO uint32_t ext1_pri4_route: 3;
        __IO uint32_t reserved_3: 1;
        __IO uint32_t ext1_pri5_route: 3;
        __IO uint32_t reserved_2: 1;
        __IO uint32_t ext1_pri6_route: 3;
        __IO uint32_t reserved_1: 1;
        __IO uint32_t ext1_pri7_route: 3;
        __IO uint32_t reserved_0: 1;
    } b;
} ETH_RRING_MAP1_TypeDef;

/* 0x74
    2:0     R/W    ext2_pri0_route             3'h0
    3       R/W    reserved3                   1'h0
    6:4     R/W    ext2_pri1_route             3'h0
    7       R/W    reserved7                   1'h0
    10:8    R/W    ext2_pri2_route             3'h0
    11      R/W    reserved11                  1'h0
    14:12   R/W    ext2_pri3_route             3'h0
    15      R/W    reserved15                  1'h0
    18:16   R/W    ext2_pri4_route             3'h0
    19      R/W    reserved19                  1'h0
    22:20   R/W    ext2_pri5_route             3'h0
    23      R/W    reserved25                  1'h0
    26:24   R/W    ext2_pri6_route             3'h0
    27      R/W    reserved27                  1'h0
    30:28   R/W    ext2_pri7_route             3'h0
    31      R/W    reserved31                  1'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t ext2_pri0_route: 3;
        __IO uint32_t reserved_7: 1;
        __IO uint32_t ext2_pri1_route: 3;
        __IO uint32_t reserved_6: 1;
        __IO uint32_t ext2_pri2_route: 3;
        __IO uint32_t reserved_5: 1;
        __IO uint32_t ext2_pri3_route: 3;
        __IO uint32_t reserved_4: 1;
        __IO uint32_t ext2_pri4_route: 3;
        __IO uint32_t reserved_3: 1;
        __IO uint32_t ext2_pri5_route: 3;
        __IO uint32_t reserved_2: 1;
        __IO uint32_t ext2_pri6_route: 3;
        __IO uint32_t reserved_1: 1;
        __IO uint32_t ext2_pri7_route: 3;
        __IO uint32_t reserved_0: 1;
    } b;
} ETH_RRING_MAP2_TypeDef;

