yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/ethernet/src/rtl87x2g/rtl_ethernet_cpu_reg.h
/* 0x78
    2:0     R/W    ext3_pri0_route             3'h0
    3       R/W    reserved3                   1'h0
    6:4     R/W    ext3_pri1_route             3'h0
    7       R/W    reserved7                   1'h0
    10:8    R/W    ext3_pri2_route             3'h0
    11      R/W    reserved11                  1'h0
    14:12   R/W    ext3_pri3_route             3'h0
    15      R/W    reserved15                  1'h0
    18:16   R/W    ext3_pri4_route             3'h0
    19      R/W    reserved19                  1'h0
    22:20   R/W    ext3_pri5_route             3'h0
    23      R/W    reserved25                  1'h0
    26:24   R/W    ext3_pri6_route             3'h0
    27      R/W    reserved27                  1'h0
    30:28   R/W    ext3_pri7_route             3'h0
    31      R/W    reserved31                  1'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t ext3_pri0_route: 3;
        __IO uint32_t reserved_7: 1;
        __IO uint32_t ext3_pri1_route: 3;
        __IO uint32_t reserved_6: 1;
        __IO uint32_t ext3_pri2_route: 3;
        __IO uint32_t reserved_5: 1;
        __IO uint32_t ext3_pri3_route: 3;
        __IO uint32_t reserved_4: 1;
        __IO uint32_t ext3_pri4_route: 3;
        __IO uint32_t reserved_3: 1;
        __IO uint32_t ext3_pri5_route: 3;
        __IO uint32_t reserved_2: 1;
        __IO uint32_t ext3_pri6_route: 3;
        __IO uint32_t reserved_1: 1;
        __IO uint32_t ext3_pri7_route: 3;
        __IO uint32_t reserved_0: 1;
    } b;
} ETH_RRING_MAP3_TypeDef;

/* 0x7C
    2:0     R/W    ext4_pri0_route             3'h0
    3       R/W    reserved3                   1'h0
    6:4     R/W    ext4_pri1_route             3'h0
    7       R/W    reserved7                   1'h0
    10:8    R/W    ext4_pri2_route             3'h0
    11      R/W    reserved11                  1'h0
    14:12   R/W    ext4_pri3_route             3'h0
    15      R/W    reserved15                  1'h0
    18:16   R/W    ext4_pri4_route             3'h0
    19      R/W    reserved19                  1'h0
    22:20   R/W    ext4_pri5_route             3'h0
    23      R/W    reserved25                  1'h0
    26:24   R/W    ext4_pri6_route             3'h0
    27      R/W    reserved27                  1'h0
    30:28   R/W    ext4_pri7_route             3'h0
    31      R/W    reserved31                  1'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t ext4_pri0_route: 3;
        __IO uint32_t reserved_7: 1;
        __IO uint32_t ext4_pri1_route: 3;
        __IO uint32_t reserved_6: 1;
        __IO uint32_t ext4_pri2_route: 3;
        __IO uint32_t reserved_5: 1;
        __IO uint32_t ext4_pri3_route: 3;
        __IO uint32_t reserved_4: 1;
        __IO uint32_t ext4_pri4_route: 3;
        __IO uint32_t reserved_3: 1;
        __IO uint32_t ext4_pri5_route: 3;
        __IO uint32_t reserved_2: 1;
        __IO uint32_t ext4_pri6_route: 3;
        __IO uint32_t reserved_1: 1;
        __IO uint32_t ext4_pri7_route: 3;
        __IO uint32_t reserved_0: 1;
    } b;
} ETH_RRING_MAP4_TypeDef;

/* 0x80
    2:0     R/W    ext5_pri0_route             3'h0
    3       R/W    reserved3                   1'h0
    6:4     R/W    ext5_pri1_route             3'h0
    7       R/W    reserved7                   1'h0
    10:8    R/W    ext5_pri2_route             3'h0
    11      R/W    reserved11                  1'h0
    14:12   R/W    ext5_pri3_route             3'h0
    15      R/W    reserved15                  1'h0
    18:16   R/W    ext5_pri4_route             3'h0
    19      R/W    reserved19                  1'h0
    22:20   R/W    ext5_pri5_route             3'h0
    23      R/W    reserved25                  1'h0
    26:24   R/W    ext5_pri6_route             3'h0
    27      R/W    reserved27                  1'h0
    30:28   R/W    ext5_pri7_route             3'h0
    31      R/W    reserved31                  1'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t ext5_pri0_route: 3;
        __IO uint32_t reserved_7: 1;
        __IO uint32_t ext5_pri1_route: 3;
        __IO uint32_t reserved_6: 1;
        __IO uint32_t ext5_pri2_route: 3;
        __IO uint32_t reserved_5: 1;
        __IO uint32_t ext5_pri3_route: 3;
        __IO uint32_t reserved_4: 1;
        __IO uint32_t ext5_pri4_route: 3;
        __IO uint32_t reserved_3: 1;
        __IO uint32_t ext5_pri5_route: 3;
        __IO uint32_t reserved_2: 1;
        __IO uint32_t ext5_pri6_route: 3;
        __IO uint32_t reserved_1: 1;
        __IO uint32_t ext5_pri7_route: 3;
        __IO uint32_t reserved_0: 1;
    } b;
} ETH_RRING_MAP5_TypeDef;

/* 0x84
    2:0     R/W    ext6_pri0_route             3'h0
    3       R/W    reserved3                   1'h0
    6:4     R/W    ext6_pri1_route             3'h0
    7       R/W    reserved7                   1'h0
    10:8    R/W    ext6_pri2_route             3'h0
    11      R/W    reserved11                  1'h0
    14:12   R/W    ext6_pri3_route             3'h0
    15      R/W    reserved15                  1'h0
    18:16   R/W    ext6_pri4_route             3'h0
    19      R/W    reserved19                  1'h0
    22:20   R/W    ext6_pri5_route             3'h0
    23      R/W    reserved25                  1'h0
    26:24   R/W    ext6_pri6_route             3'h0
    27      R/W    reserved27                  1'h0
    30:28   R/W    ext6_pri7_route             3'h0
    31      R/W    reserved31                  1'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t ext6_pri0_route: 3;
        __IO uint32_t reserved_7: 1;
        __IO uint32_t ext6_pri1_route: 3;
        __IO uint32_t reserved_6: 1;
        __IO uint32_t ext6_pri2_route: 3;
        __IO uint32_t reserved_5: 1;
        __IO uint32_t ext6_pri3_route: 3;
        __IO uint32_t reserved_4: 1;
        __IO uint32_t ext6_pri4_route: 3;
        __IO uint32_t reserved_3: 1;
        __IO uint32_t ext6_pri5_route: 3;
        __IO uint32_t reserved_2: 1;
        __IO uint32_t ext6_pri6_route: 3;
        __IO uint32_t reserved_1: 1;
        __IO uint32_t ext6_pri7_route: 3;
        __IO uint32_t reserved_0: 1;
    } b;
} ETH_RRING_MAP6_TypeDef;

