yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/ethernet/src/rtl87x2g/rtl_ethernet_cpu_reg.h
/* 0x90
    31:0    R/W    rxfdp2                      32'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t rxfdp2: 32;
    } b;
} ETH_RXFDP2_TypeDef;

/* 0x94
    11:0    R      rxcdo2                      12'h0
    15:12   R/W    reserved15_12               4'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        __I uint16_t rxcdo2: 12;
        __IO uint16_t reserved_0: 4;
    } b;
} ETH_RXCDO2_TypeDef;

/* 0x96
    11:0    R/W    rx_ring_size2               12'h0
    15:12   R/W    reserved15_12               4'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        __IO uint16_t rx_ring_size2: 12;
        __IO uint16_t reserved_0: 4;
    } b;
} ETH_RXRINGSIZE2_TypeDef;

/* 0x98
    11:0    R/W    eth_rx_cpu_des_num2         12'h0
    31:12   R/W    reserved31_12               20'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t eth_rx_cpu_des_num2: 12;
        __IO uint32_t reserved_0: 20;
    } b;
} ETH_RX_CPU_DESN2_TypeDef;

/* 0x9C
    11:0    R/W    rx_pse_des_thres_off2       12'h0
    15:12   R/W    reserved15_12               4'h0
    27:16   R/W    rx_pse_des_thres_on2        12'h0
    31:28   R/W    reserved31_28               4'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t rx_pse_des_thres_off2: 12;
        __IO uint32_t reserved_1: 4;
        __IO uint32_t rx_pse_des_thres_on2: 12;
        __IO uint32_t reserved_0: 4;
    } b;
} ETH_RX_DES_THRES2_TypeDef;

/* 0xA0
    31:0    R/W    rxfdp3                      32'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t rxfdp3: 32;
    } b;
} ETH_RXFDP3_TypeDef;

/* 0xA4
    11:0    R      rxcdo3                      12'h0
    15:12   R/W    reserved15_12               4'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        __I uint16_t rxcdo3: 12;
        __IO uint16_t reserved_0: 4;
    } b;
} ETH_RXCDO3_TypeDef;

/* 0xA6
    11:0    R/W    rx_ring_size3               12'h0
    15:12   R/W    reserved15_12               4'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        __IO uint16_t rx_ring_size3: 12;
        __IO uint16_t reserved_0: 4;
    } b;
} ETH_RXRINGSIZE3_TypeDef;

/* 0xA8
    11:0    R/W    eth_rx_cpu_des_num3         12'h0
    31:12   R/W    reserved31_12               20'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t eth_rx_cpu_des_num3: 12;
        __IO uint32_t reserved_0: 20;
    } b;
} ETH_RX_CPU_DESN3_TypeDef;

/* 0xAC
    11:0    R/W    rx_pse_des_thres_off3       12'h0
    15:12   R/W    reserved15_12               4'h0
    27:16   R/W    rx_pse_des_thres_on3        12'h0
    31:28   R/W    reserved31_28               4'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t rx_pse_des_thres_off3: 12;
        __IO uint32_t reserved_1: 4;
        __IO uint32_t rx_pse_des_thres_on3: 12;
        __IO uint32_t reserved_0: 4;
    } b;
} ETH_RX_DES_THRES3_TypeDef;

/* 0xB0
    31:0    R/W    rxfdp4                      32'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t rxfdp4: 32;
    } b;
} ETH_RXFDP4_TypeDef;

/* 0xB4
    11:0    R      rxcdo4                      12'h0
    15:12   R/W    reserved15_12               4'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        __I uint16_t rxcdo4: 12;
        __IO uint16_t reserved_0: 4;
    } b;
} ETH_RXCDO4_TypeDef;

/* 0xB6
    11:0    R/W    rx_ring_size4               12'h0
    15:12   R/W    reserved15_12               4'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        __IO uint16_t rx_ring_size4: 12;
        __IO uint16_t reserved_0: 4;
    } b;
} ETH_RXRINGSIZE4_TypeDef;

/* 0xB8
    11:0    R/W    eth_rx_cpu_des_num4         12'h0
    31:12   R/W    reserved31_12               20'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t eth_rx_cpu_des_num4: 12;
        __IO uint32_t reserved_0: 20;
    } b;
} ETH_RX_CPU_DESN4_TypeDef;

/* 0xBC
    11:0    R/W    rx_pse_des_thres_off4       12'h0
    15:12   R/W    reserved15_12               4'h0
    27:16   R/W    rx_pse_des_thres_on4        12'h0
    31:28   R/W    reserved31_28               4'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t rx_pse_des_thres_off4: 12;
        __IO uint32_t reserved_1: 4;
        __IO uint32_t rx_pse_des_thres_on4: 12;
        __IO uint32_t reserved_0: 4;
    } b;
} ETH_RX_DES_THRES4_TypeDef;

/* 0xC0
    31:0    R/W    rxfdp5                      32'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t rxfdp5: 32;
    } b;
} ETH_RXFDP5_TypeDef;

/* 0xC4
    11:0    R      rxcdo5                      12'h0
    15:12   R/W    reserved15_12               4'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        __I uint16_t rxcdo5: 12;
        __IO uint16_t reserved_0: 4;
    } b;
} ETH_RXCDO5_TypeDef;

/* 0xC6
    11:0    R/W    rx_ring_size5               12'h0
    15:12   R/W    reserved15_12               4'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        __IO uint16_t rx_ring_size5: 12;
        __IO uint16_t reserved_0: 4;
    } b;
} ETH_RXRINGSIZE5_TypeDef;

/* 0xC8
    11:0    R/W    eth_rx_cpu_des_num5         12'h0
    31:12   R/W    reserved31_12               20'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t eth_rx_cpu_des_num5: 12;
        __IO uint32_t reserved_0: 20;
    } b;
} ETH_RX_CPU_DESN5_TypeDef;

/* 0xCC
    11:0    R/W    rx_pse_des_thres_off5       12'h0
    15:12   R/W    reserved15_12               4'h0
    27:16   R/W    rx_pse_des_thres_on5        12'h0
    31:28   R/W    reserved31_28               4'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t rx_pse_des_thres_off5: 12;
        __IO uint32_t reserved_1: 4;
        __IO uint32_t rx_pse_des_thres_on5: 12;
        __IO uint32_t reserved_0: 4;
    } b;
} ETH_RX_DES_THRES5_TypeDef;

/* 0xD0
    31:0    R/W    rxfdp6                      32'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t rxfdp6: 32;
    } b;
} ETH_RXFDP6_TypeDef;

/* 0xD4
    11:0    R      rxcdo6                      12'h0
    15:12   R/W    reserved15_12               4'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        __I uint16_t rxcdo6: 12;
        __IO uint16_t reserved_0: 4;
    } b;
} ETH_RXCDO6_TypeDef;

/* 0xD6
    11:0    R/W    rx_ring_size6               12'h0
    15:12   R/W    reserved15_12               4'h0
*/
typedef union
{
    uint16_t d16;
    uint8_t d8[2];
    struct
    {
        __IO uint16_t rx_ring_size6: 12;
        __IO uint16_t reserved_0: 4;
    } b;
} ETH_RXRINGSIZE6_TypeDef;

/* 0xD8
    11:0    R/W    eth_rx_cpu_des_num6         12'h0
    31:12   R/W    reserved31_12               20'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t eth_rx_cpu_des_num6: 12;
        __IO uint32_t reserved_0: 20;
    } b;
} ETH_RX_CPU_DESN6_TypeDef;

/* 0xDC
    11:0    R/W    rx_pse_des_thres_off6       12'h0
    15:12   R/W    reserved15_12               4'h0
    27:16   R/W    rx_pse_des_thres_on6        12'h0
    31:28   R/W    reserved31_28               4'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t rx_pse_des_thres_off6: 12;
        __IO uint32_t reserved_1: 4;
        __IO uint32_t rx_pse_des_thres_on6: 12;
        __IO uint32_t reserved_0: 4;
    } b;
} ETH_RX_DES_THRES6_TypeDef;

/* 0xF0
    31:0    R/W    rxfdp1                      32'h0
*/
typedef union
{
    uint32_t d32;
    uint8_t d8[4];
    struct
    {
        __IO uint32_t rxfdp1: 32;
    } b;
} ETH_RXFDP1_TypeDef;

